
## Plan Result (client-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/7784)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 67 to add, 0 to change, 71 to destroy.</code></pre>

* Create
  * aws_acm_certificate.application_alb_certificate_93966247
  * aws_acm_certificate.application_cdn_certificate_E17B2815
  * aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195
  * aws_acm_certificate_validation.application_cdn_certificate_certificate_validation_F216BBC7
  * aws_alb.application_application_load_balancer_alb_05EA9801
  * aws_alb_listener.application_listener_http_D74EC0ED
  * aws_alb_listener.application_listener_https_D31CB055
  * aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F
  * aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B
  * aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6
  * aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511
  * aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2
  * aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99
  * aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21
  * aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED
  * aws_cloudwatch_log_group.app-log-group
  * aws_cloudwatch_log_group.aws-otel-collector-log-group
  * aws_cloudwatch_metric_alarm.application_alarm-httpresponsetime_9124C30A
  * aws_cloudwatch_metric_alarm.application_alarm-httptarget5xxerrorrate_F94D87C0
  * aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1
  * aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0
  * aws_cloudwatch_metric_alarm.synthetics_synthetics_synthetic_check_alarm_uptime_0_3A56DFC7
  * aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF
  * aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247
  * aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE
  * aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7
  * aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0
  * aws_ecs_cluster.application_ecs_cluster_4DC6EFB3
  * aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4
  * aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9
  * aws_elasticache_subnet_group.memcached_elasticache_subnet_group_F45C696C
  * aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77
  * aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6
  * aws_iam_policy.synthetics_synthetics_synthetic_check_access_policy_9A7D8849
  * aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA
  * aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED
  * aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3
  * aws_iam_role.synthetics_synthetic_check_role_A3A5C38B
  * aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355
  * aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E
  * aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF
  * aws_iam_role_policy_attachment.application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725
  * aws_iam_role_policy_attachment.synthetics_synthetics_synthetic_check_access_attach_BC7F9559
  * aws_route53_record.application_alb_certificate_certificate_record_51B45CF2
  * aws_route53_record.application_alb_record_8EA9D3F9
  * aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22
  * aws_route53_record.application_cdn_certificate_certificate_record_F3EF0357
  * aws_route53_record.application_cdn_record_B2BBECBB
  * aws_route53_zone.application_base_dns_subhosted_zone_77521D1C
  * aws_s3_bucket.synthetics_synthetics_synthetic_check_artifacts_53DD59E6
  * aws_s3_bucket_lifecycle_configuration.synthetics_synthetics_synthetic_check_artifacts_lifecycle_5A7B9150
  * aws_security_group.application_application_load_balancer_alb_security_group_7B45D070
  * aws_security_group.application_ecs_service_ecs_security_group_231C6B1E
  * aws_security_group.memcached_elasticache_security_group_B1576B6B
  * aws_sns_topic.pagerduty_alarm-critical-topic_F1534579
  * aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3
  * aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84
  * aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B
  * aws_synthetics_canary.synthetics_synthetics_synthetic_check_uptime_0_4168D0DB
  * local_file.application_ecs_service_appspec_94386B9C
  * pagerduty_service.pagerduty_pagerduty-critical_464EE7CD
  * pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938
  * pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5
  * pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C
  * pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23
  * pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197
* Delete
  * aws_acm_certificate.clientapi_application_albcertificate_8F08A8B5
  * aws_acm_certificate.clientapi_application_cdncertificate_7C2F79DF
  * aws_acm_certificate_validation.clientapi_application_albcertificate_certificatevalidation_3FE5DA00
  * aws_acm_certificate_validation.clientapi_application_cdncertificate_certificatevalidation_79B2A7FF
  * aws_alb.clientapi_application_applicationloadbalancer_alb_8E422DB0
  * aws_alb_listener.clientapi_application_listenerhttp_EDDC6504
  * aws_alb_listener.clientapi_application_listenerhttps_E64549DC
  * aws_alb_listener_rule.clientapi_application_ecsservice_listenerrule_CA71EA52
  * aws_alb_target_group.clientapi_application_ecsservice_bluetargetgroup_ecstargetgroup_6B37920C
  * aws_alb_target_group.clientapi_application_ecsservice_greentargetgroup_ecstargetgroup_1CE1A8DE
  * aws_appautoscaling_policy.clientapi_application_autoscaling_scaleinpolicy_1EF54B23
  * aws_appautoscaling_policy.clientapi_application_autoscaling_scaleoutpolicy_61B8160F
  * aws_appautoscaling_target.clientapi_application_autoscaling_autoscalingtarget_FF7FB7D5
  * aws_cloudfront_distribution.clientapi_application_cloudfrontdistribution_CFE60B0B
  * aws_cloudwatch_dashboard.clientapi_application_cloudwatchdashboard_97E9BF82
  * aws_cloudwatch_log_group.clientapi_apploggroup_D7D751DC
  * aws_cloudwatch_log_group.clientapi_awsotelcollectorloggroup_5208F4A2
  * aws_cloudwatch_metric_alarm.clientapi_application_alarmhttpresponsetime_7DB8C818
  * aws_cloudwatch_metric_alarm.clientapi_application_alarmhttptarget5xxerrorrate_84D0FB57
  * aws_cloudwatch_metric_alarm.clientapi_application_autoscaling_scaleinalarm_26EDE0F0
  * aws_cloudwatch_metric_alarm.clientapi_application_autoscaling_scaleoutalarm_24078E56
  * aws_cloudwatch_metric_alarm.clientapi_synthetics_syntheticssyntheticcheckalarmuptime0_08277E71
  * aws_codedeploy_app.clientapi_application_ecsservice_ecscodedeploy_ecscodedeploy_B638157D
  * aws_codedeploy_deployment_group.clientapi_application_ecsservice_ecscodedeploy_ecscodedeploydeploymentgroup_3CFACCC4
  * aws_codepipeline.clientapi_codepipeline_codepipeline_660ED74F
  * aws_codestarnotifications_notification_rule.clientapi_application_ecsservice_ecscodedeploy_ecscodedeploynotifications_AA2FEBE8
  * aws_ecr_lifecycle_policy.clientapi_application_ecsservice_ecrapp_ecrrepolifecyclepolicy_A5468148
  * aws_ecr_repository.clientapi_application_ecsservice_ecrapp_ecrrepo_C4DADF3F
  * aws_ecs_cluster.clientapi_application_ecscluster_7FF409F3
  * aws_ecs_service.clientapi_application_ecsservice_ecsservice_EEE8C8C7
  * aws_ecs_task_definition.clientapi_application_ecsservice_ecstask_B7672A43
  * aws_elasticache_cluster.clientapi_memcached_elasticachecluster_9528B490
  * aws_elasticache_subnet_group.clientapi_memcached_elasticachesubnetgroup_66FF363B
  * aws_iam_policy.clientapi_application_ecsservice_ecsiam_ecstaskexecutionrolepolicy_C7082889
  * aws_iam_policy.clientapi_application_ecsservice_ecsiam_ecstaskrolepolicy_025AD0A0
  * aws_iam_policy.clientapi_synthetics_syntheticssyntheticcheckaccesspolicy_3688D832
  * aws_iam_role.clientapi_application_ecsservice_ecscodedeploy_ecscodedeployrole_ED1F1C15
  * aws_iam_role.clientapi_application_ecsservice_ecsiam_ecsexecutionrole_9C05B569
  * aws_iam_role.clientapi_application_ecsservice_ecsiam_ecstaskrole_3AB9EBE6
  * aws_iam_role.clientapi_codepipeline_codepipelinerole_E29366E7
  * aws_iam_role.clientapi_synthetics_syntheticcheckrole_A64B0CF9
  * aws_iam_role_policy.clientapi_codepipeline_codepipelinerolepolicy_F2221036
  * aws_iam_role_policy_attachment.clientapi_application_ecsservice_ecscodedeploy_ecscodedeployroleattachment_7FF32E85
  * aws_iam_role_policy_attachment.clientapi_application_ecsservice_ecsiam_ecstaskcustomattachment_36D63BE2
  * aws_iam_role_policy_attachment.clientapi_application_ecsservice_ecsiam_ecstaskexecutioncustomattachment_25617C66
  * aws_iam_role_policy_attachment.clientapi_application_ecsservice_ecsiam_ecstaskexecutiondefaultattachment_E4DEB2F2
  * aws_iam_role_policy_attachment.clientapi_synthetics_syntheticssyntheticcheckaccessattach_7DFBE7CE
  * aws_route53_record.clientapi_application_albcertificate_certificaterecord_29EC4C37
  * aws_route53_record.clientapi_application_albrecord_769455EF
  * aws_route53_record.clientapi_application_basedns_subhostedzonens_6ED741F3
  * aws_route53_record.clientapi_application_cdncertificate_certificaterecord_62040419
  * aws_route53_record.clientapi_application_cdnrecord_9F72C449
  * aws_route53_zone.clientapi_application_basedns_subhostedzone_6F3B33E7
  * aws_s3_bucket.clientapi_codepipeline_codepipelinebucket_14403D68
  * aws_s3_bucket.clientapi_synthetics_syntheticssyntheticcheckartifacts_E01D13AA
  * aws_s3_bucket_lifecycle_configuration.clientapi_synthetics_syntheticssyntheticcheckartifactslifecycle_B7D10FB6
  * aws_security_group.clientapi_application_applicationloadbalancer_albsecuritygroup_3C6D8CFE
  * aws_security_group.clientapi_application_ecsservice_ecssecuritygroup_9962CC25
  * aws_security_group.clientapi_memcached_elasticachesecuritygroup_53EC2787
  * aws_sns_topic.clientapi_pagerduty_alarmcriticaltopic_E9BAFF0B
  * aws_sns_topic.clientapi_pagerduty_alarmnoncriticaltopic_8AFB1875
  * aws_sns_topic_subscription.clientapi_pagerduty_alarmcriticalsubscription_A95840DF
  * aws_sns_topic_subscription.clientapi_pagerduty_alarmnoncriticalsubscription_E7BA7235
  * aws_synthetics_canary.clientapi_synthetics_syntheticssyntheticcheckuptime0_03AAF1EE
  * null_resource.clientapi_application_ecsservice_createtaskdefinitionfile_07F26FA4
  * pagerduty_service.clientapi_pagerduty_pagerdutycritical_7BA5D75C
  * pagerduty_service.clientapi_pagerduty_pagerdutynoncritical_D8F8294E
  * pagerduty_service_integration.clientapi_pagerduty_clientapipagerdutycloudwatchA8F72596critical_6221C98E
  * pagerduty_service_integration.clientapi_pagerduty_clientapipagerdutycloudwatchA8F72596noncritical_A0B1A7EF
  * pagerduty_service_integration.clientapi_pagerduty_clientapipagerdutysentryD58E8996critical_D813B5C7
  * pagerduty_service_integration.clientapi_pagerduty_clientapipagerdutysentryD58E8996noncritical_77F78692


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_access_4C83FECF will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "synthetics_synthetics_synthetic_check_access_4C83FECF" {
      + id      = (known after apply)
      + json    = (known after apply)
      + version = "2012-10-17"

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::pocket-syntheticchecks-prod/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetBucketLocation",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListAllMyBuckets",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:PutMetricData",
            ]
          + resources = [
              + "*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "CloudWatchSynthetics",
                ]
              + variable = "cloudwatch:namespace"
            }
        }
      + statement {
          + actions   = [
              + "ec2:AttachNetworkInterface",
              + "ec2:CreateNetworkInterface",
              + "ec2:DeleteNetworkInterface",
              + "ec2:DescribeNetworkInterfaces",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # aws_acm_certificate.application_alb_certificate_93966247 will be created
  + resource "aws_acm_certificate" "application_alb_certificate_93966247" {
      + arn                       = (known after apply)
      + domain_name               = "direct.client-api.getpocket.com"
      + domain_validation_options = [
          + {
              + domain_name           = "direct.client-api.getpocket.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "direct.client-api.getpocket.com",
        ]
      + tags                      = {
          + "environment" = "Prod"
          + "service"     = "ClientAPI"
        }
      + tags_all                  = {
          + "environment" = "Prod"
          + "service"     = "ClientAPI"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate.application_cdn_certificate_E17B2815 will be created
  + resource "aws_acm_certificate" "application_cdn_certificate_E17B2815" {
      + arn                       = (known after apply)
      + domain_name               = "client-api.getpocket.com"
      + domain_validation_options = [
          + {
              + domain_name           = "client-api.getpocket.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "client-api.getpocket.com",
        ]
      + tags                      = {
          + "environment" = "Prod"
          + "service"     = "ClientAPI"
        }
      + tags_all                  = {
          + "environment" = "Prod"
          + "service"     = "ClientAPI"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate.clientapi_application_albcertificate_8F08A8B5 will be destroyed
  # (because aws_acm_certificate.clientapi_application_albcertificate_8F08A8B5 is not in configuration)
  - resource "aws_acm_certificate" "clientapi_application_albcertificate_8F08A8B5" {
      - arn                       = "arn:aws:acm:us-east-1:996905175585:certificate/1f06e993-c1b7-4c24-a679-a5dbe25303e1" -> null
      - domain_name               = "direct.client-api.getpocket.com" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "direct.client-api.getpocket.com"
              - resource_record_name  = "_2f83a87c35f947890501f71c80fa8a17.direct.client-api.getpocket.com."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_c7e5627046b6098a0043473f04024fa4.vtqfhvjlcp.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:us-east-1:996905175585:certificate/1f06e993-c1b7-4c24-a679-a5dbe25303e1" -> null
      - key_algorithm             = "RSA_2048" -> null
      - not_after                 = "2024-11-12T23:59:59Z" -> null
      - not_before                = "2023-10-15T00:00:00Z" -> null
      - pending_renewal           = false -> null
      - renewal_eligibility       = "ELIGIBLE" -> null
      - renewal_summary           = [
          - {
              - renewal_status        = "SUCCESS"
              - renewal_status_reason = ""
              - updated_at            = "2023-10-15T05:59:57Z"
            },
        ] -> null
      - status                    = "ISSUED" -> null
      - subject_alternative_names = [
          - "direct.client-api.getpocket.com",
        ] -> null
      - tags                      = {
          - "environment" = "Prod"
          - "service"     = "ClientAPI"
        } -> null
      - tags_all                  = {
          - "environment" = "Prod"
          - "service"     = "ClientAPI"
        } -> null
      - type                      = "AMAZON_ISSUED" -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_acm_certificate.clientapi_application_cdncertificate_7C2F79DF will be destroyed
  # (because aws_acm_certificate.clientapi_application_cdncertificate_7C2F79DF is not in configuration)
  - resource "aws_acm_certificate" "clientapi_application_cdncertificate_7C2F79DF" {
      - arn                       = "arn:aws:acm:us-east-1:996905175585:certificate/c3cba45a-abe9-4090-bece-c6fae2346b8f" -> null
      - domain_name               = "client-api.getpocket.com" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "client-api.getpocket.com"
              - resource_record_name  = "_a00658900aaaf921ae7e2a29a211e0cd.client-api.getpocket.com."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_989bf76de3544c64887a9f0a6af93662.vtqfhvjlcp.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:us-east-1:996905175585:certificate/c3cba45a-abe9-4090-bece-c6fae2346b8f" -> null
      - key_algorithm             = "RSA_2048" -> null
      - not_after                 = "2024-11-12T23:59:59Z" -> null
      - not_before                = "2023-10-15T00:00:00Z" -> null
      - pending_renewal           = false -> null
      - renewal_eligibility       = "ELIGIBLE" -> null
      - renewal_summary           = [
          - {
              - renewal_status        = "SUCCESS"
              - renewal_status_reason = ""
              - updated_at            = "2023-10-15T06:00:09Z"
            },
        ] -> null
      - status                    = "ISSUED" -> null
      - subject_alternative_names = [
          - "client-api.getpocket.com",
        ] -> null
      - tags                      = {
          - "environment" = "Prod"
          - "service"     = "ClientAPI"
        } -> null
      - tags_all                  = {
          - "environment" = "Prod"
          - "service"     = "ClientAPI"
        } -> null
      - type                      = "AMAZON_ISSUED" -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195 will be created
  + resource "aws_acm_certificate_validation" "application_alb_certificate_certificate_validation_25DAB195" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_acm_certificate_validation.application_cdn_certificate_certificate_validation_F216BBC7 will be created
  + resource "aws_acm_certificate_validation" "application_cdn_certificate_certificate_validation_F216BBC7" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_acm_certificate_validation.clientapi_application_albcertificate_certificatevalidation_3FE5DA00 will be destroyed
  # (because aws_acm_certificate_validation.clientapi_application_albcertificate_certificatevalidation_3FE5DA00 is not in configuration)
  - resource "aws_acm_certificate_validation" "clientapi_application_albcertificate_certificatevalidation_3FE5DA00" {
      - certificate_arn         = "arn:aws:acm:us-east-1:996905175585:certificate/1f06e993-c1b7-4c24-a679-a5dbe25303e1" -> null
      - id                      = "2021-12-14 06:07:37.947 +0000 UTC" -> null
      - validation_record_fqdns = [
          - "_2f83a87c35f947890501f71c80fa8a17.direct.client-api.getpocket.com",
        ] -> null
    }

  # aws_acm_certificate_validation.clientapi_application_cdncertificate_certificatevalidation_79B2A7FF will be destroyed
  # (because aws_acm_certificate_validation.clientapi_application_cdncertificate_certificatevalidation_79B2A7FF is not in configuration)
  - resource "aws_acm_certificate_validation" "clientapi_application_cdncertificate_certificatevalidation_79B2A7FF" {
      - certificate_arn         = "arn:aws:acm:us-east-1:996905175585:certificate/c3cba45a-abe9-4090-bece-c6fae2346b8f" -> null
      - id                      = "2021-12-14 05:32:03.073 +0000 UTC" -> null
      - validation_record_fqdns = [
          - "_a00658900aaaf921ae7e2a29a211e0cd.client-api.getpocket.com",
        ] -> null
    }

  # aws_alb.application_application_load_balancer_alb_05EA9801 will be created
  + resource "aws_alb" "application_application_load_balancer_alb_05EA9801" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = (known after apply)
      + name_prefix                                                  = "CAPI"
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-36c2611d",
          + "subnet-420db61b",
          + "subnet-5a0f952d",
          + "subnet-6b400e51",
        ]
      + tags                                                         = {
          + "environment" = "Prod"
          + "service"     = "ClientAPI"
        }
      + tags_all                                                     = {
          + "environment" = "Prod"
          + "service"     = "ClientAPI"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + access_logs {
          + bucket  = "pocket-data-items"
          + enabled = true
          + prefix  = "server-logs/clientapi-prod/alb"
        }
    }

  # aws_alb.clientapi_application_applicationloadbalancer_alb_8E422DB0 will be destroyed
  # (because aws_alb.clientapi_application_applicationloadbalancer_alb_8E422DB0 is not in configuration)
  - resource "aws_alb" "clientapi_application_applicationloadbalancer_alb_8E422DB0" {
      - arn                                         = "arn:aws:elasticloadbalancing:us-east-1:996905175585:loadbalancer/app/CAPI2021011323491776640000000e/c546aaa092741217" -> null
      - arn_suffix                                  = "app/CAPI2021011323491776640000000e/c546aaa092741217" -> null
      - desync_mitigation_mode                      = "defensive" -> null
      - dns_name                                    = "CAPI2021011323491776640000000e-372607440.us-east-1.elb.amazonaws.com" -> null
      - drop_invalid_header_fields                  = false -> null
      - enable_cross_zone_load_balancing            = true -> null
      - enable_deletion_protection                  = false -> null
      - enable_http2                                = true -> null
      - enable_tls_version_and_cipher_suite_headers = false -> null
      - enable_waf_fail_open                        = false -> null
      - enable_xff_client_port                      = false -> null
      - id                                          = "arn:aws:elasticloadbalancing:us-east-1:996905175585:loadbalancer/app/CAPI2021011323491776640000000e/c546aaa092741217" -> null
      - idle_timeout                                = 60 -> null
      - internal                                    = false -> null
      - ip_address_type                             = "ipv4" -> null
      - load_balancer_type                          = "application" -> null
      - name                                        = "CAPI2021011323491776640000000e" -> null
      - name_prefix                                 = "CAPI" -> null
      - preserve_host_header                        = false -> null
      - security_groups                             = [
          - "sg-0da13530698d2590c",
        ] -> null
      - subnets                                     = [
          - "subnet-36c2611d",
          - "subnet-420db61b",
          - "subnet-5a0f952d",
          - "subnet-6b400e51",
        ] -> null
      - tags                                        = {
          - "environment" = "Prod"
          - "service"     = "ClientAPI"
        } -> null
      - tags_all                                    = {
          - "environment" = "Prod"
          - "service"     = "ClientAPI"
        } -> null
      - vpc_id                                      = "vpc-867638e3" -> null
      - xff_header_processing_mode                  = "append" -> null
      - zone_id                                     = "Z35SXDOTRQ7X7K" -> null

      - access_logs {
          - bucket  = "pocket-data-items" -> null
          - enabled = true -> null
          - prefix  = "server-logs/clientapi-prod/alb" -> null
        }

      - connection_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-36c2611d" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-420db61b" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-5a0f952d" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-6b400e51" -> null
        }
    }

  # aws_alb_listener.application_listener_http_D74EC0ED will be created
  + resource "aws_alb_listener" "application_listener_http_D74EC0ED" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "environment" = "Prod"
          + "service"     = "ClientAPI"
        }
      + tags_all          = {
          + "environment" = "Prod"
          + "service"     = "ClientAPI"
        }

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # aws_alb_listener.application_listener_https_D31CB055 will be created
  + resource "aws_alb_listener" "application_listener_https_D31CB055" {
      + arn               = (known after apply)
      + certificate_arn   = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-TLS-1-1-2017-01"
      + tags              = {
          + "environment" = "Prod"
          + "service"     = "ClientAPI"
        }
      + tags_all          = {
          + "environment" = "Prod"
          + "service"     = "ClientAPI"
        }

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
     

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

75585:ClientAPI-Prod-Infrastructure-Alarm-Critical" -> null
    }

  # aws_sns_topic_subscription.clientapi_pagerduty_alarmnoncriticalsubscription_E7BA7235 will be destroyed
  # (because aws_sns_topic_subscription.clientapi_pagerduty_alarmnoncriticalsubscription_E7BA7235 is not in configuration)
  - resource "aws_sns_topic_subscription" "clientapi_pagerduty_alarmnoncriticalsubscription_E7BA7235" {
      - arn                             = "arn:aws:sns:us-east-1:996905175585:ClientAPI-Prod-Infrastructure-Alarm-Non-Critical:11a07ab7-9d9a-47f2-afd8-2c2b0d0aaaa6" -> null
      - confirmation_timeout_in_minutes = 2 -> null
      - confirmation_was_authenticated  = false -> null
      - endpoint                        = "https://events.pagerduty.com/integration/d8da60e34b4a4407d09e4e6153f4c470/enqueue" -> null
      - endpoint_auto_confirms          = true -> null
      - id                              = "arn:aws:sns:us-east-1:996905175585:ClientAPI-Prod-Infrastructure-Alarm-Non-Critical:11a07ab7-9d9a-47f2-afd8-2c2b0d0aaaa6" -> null
      - owner_id                        = "996905175585" -> null
      - pending_confirmation            = false -> null
      - protocol                        = "https" -> null
      - raw_message_delivery            = false -> null
      - topic_arn                       = "arn:aws:sns:us-east-1:996905175585:ClientAPI-Prod-Infrastructure-Alarm-Non-Critical" -> null
    }

  # aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84 will be created
  + resource "aws_sns_topic_subscription" "pagerduty_alarm-critical-subscription_E2168B84" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 2
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = true
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "https"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B will be created
  + resource "aws_sns_topic_subscription" "pagerduty_alarm-non-critical-subscription_4702677B" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 2
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = true
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "https"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_synthetics_canary.clientapi_synthetics_syntheticssyntheticcheckuptime0_03AAF1EE will be destroyed
  # (because aws_synthetics_canary.clientapi_synthetics_syntheticssyntheticcheckuptime0_03AAF1EE is not in configuration)
  - resource "aws_synthetics_canary" "clientapi_synthetics_syntheticssyntheticcheckuptime0_03AAF1EE" {
      - arn                      = "arn:aws:synthetics:us-east-1:996905175585:canary:capi-prod-uptime-0" -> null
      - artifact_s3_location     = "pocket-clientapi-prod-synthetic-checks/" -> null
      - delete_lambda            = false -> null
      - engine_arn               = "arn:aws:lambda:us-east-1:996905175585:function:cwsyn-capi-prod-uptime-0-d353ff55-9970-44b3-8a3d-87bb3fa5e6bd:1" -> null
      - execution_role_arn       = "arn:aws:iam::996905175585:role/pocket-clientapi-prod-synthetic-check" -> null
      - failure_retention_period = 31 -> null
      - handler                  = "synthetic.uptime" -> null
      - id                       = "capi-prod-uptime-0" -> null
      - name                     = "capi-prod-uptime-0" -> null
      - runtime_version          = "syn-nodejs-puppeteer-4.0" -> null
      - s3_bucket                = "pocket-awssynchecks-prod-code" -> null
      - s3_key                   = "synthetic-prod.zip" -> null
      - source_location_arn      = "arn:aws:lambda:us-east-1:996905175585:layer:cwsyn-capi-prod-uptime-0-d353ff55-9970-44b3-8a3d-87bb3fa5e6bd:1" -> null
      - start_canary             = true -> null
      - status                   = "RUNNING" -> null
      - success_retention_period = 31 -> null
      - tags                     = {} -> null
      - tags_all                 = {} -> null
      - timeline                 = [
          - {
              - created       = "2023-06-15T12:50:53Z"
              - last_modified = "2023-06-15T12:51:17Z"
              - last_started  = "2023-06-15T12:51:17Z"
              - last_stopped  = ""
            },
        ] -> null

      - run_config {
          - active_tracing        = false -> null
          - environment_variables = {
              - "UPTIME_BODY" = "ok"
              - "UPTIME_URL"  = "client-api.getpocket.com/.well-known/apollo/server-health"
            } -> null
          - memory_in_mb          = 1000 -> null
          - timeout_in_seconds    = 180 -> null
        }

      - schedule {
          - duration_in_seconds = 0 -> null
          - expression          = "rate(5 minutes)" -> null
        }
    }

  # aws_synthetics_canary.synthetics_synthetics_synthetic_check_uptime_0_4168D0DB will be created
  + resource "aws_synthetics_canary" "synthetics_synthetics_synthetic_check_uptime_0_4168D0DB" {
      + arn                      = (known after apply)
      + artifact_s3_location     = "s3://pocket-clientapi-prod-synthetic-checks/"
      + delete_lambda            = false
      + engine_arn               = (known after apply)
      + execution_role_arn       = (known after apply)
      + failure_retention_period = 31
      + handler                  = "synthetic.uptime"
      + id                       = (known after apply)
      + name                     = "capi-prod-uptime-0"
      + runtime_version          = "syn-nodejs-puppeteer-4.0"
      + s3_bucket                = "pocket-syntheticchecks-prod"
      + s3_key                   = "aws-synthetic-prod.zip"
      + source_location_arn      = (known after apply)
      + start_canary             = true
      + status                   = (known after apply)
      + success_retention_period = 31
      + tags_all                 = (known after apply)
      + timeline                 = (known after apply)

      + run_config {
          + environment_variables = {
              + "UPTIME_BODY" = "ok"
              + "UPTIME_URL"  = "client-api.getpocket.com/.well-known/apollo/server-health"
            }
          + memory_in_mb          = (known after apply)
          + timeout_in_seconds    = 180
        }

      + schedule {
          + expression = "rate(5 minutes)"
        }
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

  # null_resource.clientapi_application_ecsservice_createtaskdefinitionfile_07F26FA4 will be destroyed
  # (because null_resource.clientapi_application_ecsservice_createtaskdefinitionfile_07F26FA4 is not in configuration)
  - resource "null_resource" "clientapi_application_ecsservice_createtaskdefinitionfile_07F26FA4" {
      - id       = "8466172500006139410" -> null
      - triggers = {
          - "alwaysRun" = "2023-11-28T18:07:02Z"
        } -> null
    }

  # pagerduty_service.clientapi_pagerduty_pagerdutycritical_7BA5D75C will be destroyed
  # (because pagerduty_service.clientapi_pagerduty_pagerdutycritical_7BA5D75C is not in configuration)
  - resource "pagerduty_service" "clientapi_pagerduty_pagerdutycritical_7BA5D75C" {
      - acknowledgement_timeout = "1800" -> null
      - alert_creation          = "create_incidents" -> null
      - alert_grouping_timeout  = "null" -> null
      - auto_resolve_timeout    = "14400" -> null
      - created_at              = "2022-04-18T13:09:03-07:00" -> null
      - description             = "PagerDuty Critical" -> null
      - escalation_policy       = "PLPWYPC" -> null
      - html_url                = "https://mozilla.pagerduty.com/service-directory/PDGDKV4" -> null
      - id                      = "PDGDKV4" -> null
      - last_incident_timestamp = "2023-08-31T13:38:09-07:00" -> null
      - name                    = "ClientAPI-Prod-PagerDuty-Critical" -> null
      - status                  = "active" -> null
      - type                    = "service" -> null

      - alert_grouping_parameters {
        }

      - incident_urgency_rule {
          - type    = "constant" -> null
          - urgency = "high" -> null
        }
    }

  # pagerduty_service.clientapi_pagerduty_pagerdutynoncritical_D8F8294E will be destroyed
  # (because pagerduty_service.clientapi_pagerduty_pagerdutynoncritical_D8F8294E is not in configuration)
  - resource "pagerduty_service" "clientapi_pagerduty_pagerdutynoncritical_D8F8294E" {
      - acknowledgement_timeout = "1800" -> null
      - alert_creation          = "create_incidents" -> null
      - alert_grouping_timeout  = "null" -> null
      - auto_resolve_timeout    = "14400" -> null
      - created_at              = "2022-04-18T13:09:03-07:00" -> null
      - description             = "PagerDuty Non-Critical" -> null
      - escalation_policy       = "PLPWYPC" -> null
      - html_url                = "https://mozilla.pagerduty.com/service-directory/PHT1L7U" -> null
      - id                      = "PHT1L7U" -> null
      - name                    = "ClientAPI-Prod-PagerDuty-Non-Critical" -> null
      - status                  = "active" -> null
      - type                    = "service" -> null

      - alert_grouping_parameters {
        }

      - incident_urgency_rule {
          - type    = "constant" -> null
          - urgency = "low" -> null
        }
    }

  # pagerduty_service.pagerduty_pagerduty-critical_464EE7CD will be created
  + resource "pagerduty_service" "pagerduty_pagerduty-critical_464EE7CD" {
      + acknowledgement_timeout = "1800"
      + alert_creation          = "create_incidents"
      + alert_grouping          = (known after apply)
      + alert_grouping_timeout  = (known after apply)
      + auto_resolve_timeout    = "14400"
      + created_at              = (known after apply)
      + description             = "PagerDuty Critical"
      + escalation_policy       = "PLPWYPC"
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + last_incident_timestamp = (known after apply)
      + name                    = "ClientAPI-Prod-PagerDuty-Critical"
      + response_play           = (known after apply)
      + status                  = (known after apply)
      + type                    = (known after apply)

      + incident_urgency_rule {
          + type    = "constant"
          + urgency = "high"
        }
    }

  # pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938 will be created
  + resource "pagerduty_service" "pagerduty_pagerduty-non-critical_B4CB3938" {
      + acknowledgement_timeout = "1800"
      + alert_creation          = "create_incidents"
      + alert_grouping          = (known after apply)
      + alert_grouping_timeout  = (known after apply)
      + auto_resolve_timeout    = "14400"
      + created_at              = (known after apply)
      + description             = "PagerDuty Non-Critical"
      + escalation_policy       = "PLPWYPC"
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + last_incident_timestamp = (known after apply)
      + name                    = "ClientAPI-Prod-PagerDuty-Non-Critical"
      + response_play           = (known after apply)
      + status                  = (known after apply)
      + type                    = (known after apply)

      + incident_urgency_rule {
          + type    = "constant"
          + urgency = "low"
        }
    }

  # pagerduty_service_integration.clientapi_pagerduty_clientapipagerdutycloudwatchA8F72596critical_6221C98E will be destroyed
  # (because pagerduty_service_integration.clientapi_pagerduty_clientapipagerdutycloudwatchA8F72596critical_6221C98E is not in configuration)
  - resource "pagerduty_service_integration" "clientapi_pagerduty_clientapipagerdutycloudwatchA8F72596critical_6221C98E" {
      - html_url        = "https://mozilla.pagerduty.com/services/PDGDKV4/integrations/PWMH721" -> null
      - id              = "PWMH721" -> null
      - integration_key = "4cccbb85cc224a09d0fb2a4117ef6c03" -> null
      - name            = "Amazon CloudWatch" -> null
      - service         = "PDGDKV4" -> null
      - type            = "event_transformer_api_inbound_integration" -> null
      - vendor          = "PZQ6AUS" -> null
    }

  # pagerduty_service_integration.clientapi_pagerduty_clientapipagerdutycloudwatchA8F72596noncritical_A0B1A7EF will be destroyed
  # (because pagerduty_service_integration.clientapi_pagerduty_clientapipagerdutycloudwatchA8F72596noncritical_A0B1A7EF is not in configuration)
  - resource "pagerduty_service_integration" "clientapi_pagerduty_clientapipagerdutycloudwatchA8F72596noncritical_A0B1A7EF" {
      - html_url        = "https://mozilla.pagerduty.com/services/PHT1L7U/integrations/PHHE964" -> null
      - id              = "PHHE964" -> null
      - integration_key = "d8da60e34b4a4407d09e4e6153f4c470" -> null
      - name            = "Amazon CloudWatch" -> null
      - service         = "PHT1L7U" -> null
      - type            = "event_transformer_api_inbound_integration" -> null
      - vendor          = "PZQ6AUS" -> null
    }

  # pagerduty_service_integration.clientapi_pagerduty_clientapipagerdutysentryD58E8996critical_D813B5C7 will be destroyed
  # (because pagerduty_service_integration.clientapi_pagerduty_clientapipagerdutysentryD58E8996critical_D813B5C7 is not in configuration)
  - resource "pagerduty_service_integration" "clientapi_pagerduty_clientapipagerdutysentryD58E8996critical_D813B5C7" {
      - html_url        = "https://mozilla.pagerduty.com/services/PDGDKV4/integrations/PAZ57ER" -> null
      - id              = "PAZ57ER" -> null
      - integration_key = "0d47479ff322400bd029629eb3862e94" -> null
      - name            = "Sentry" -> null
      - service         = "PDGDKV4" -> null
      - type            = "app_event_transform_inbound_integration" -> null
      - vendor          = "PKAPG94" -> null
    }

  # pagerduty_service_integration.clientapi_pagerduty_clientapipagerdutysentryD58E8996noncritical_77F78692 will be destroyed
  # (because pagerduty_service_integration.clientapi_pagerduty_clientapipagerdutysentryD58E8996noncritical_77F78692 is not in configuration)
  - resource "pagerduty_service_integration" "clientapi_pagerduty_clientapipagerdutysentryD58E8996noncritical_77F78692" {
      - html_url        = "https://mozilla.pagerduty.com/services/PHT1L7U/integrations/PE8T8TE" -> null
      - id              = "PE8T8TE" -> null
      - integration_key = "99cb983576a54e0cd09595763124bba2" -> null
      - name            = "Sentry" -> null
      - service         = "PHT1L7U" -> null
      - type            = "app_event_transform_inbound_integration" -> null
      - vendor          = "PKAPG94" -> null
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

Plan: 67 to add, 0 to change, 71 to destroy.
╷
│ Warning: Deprecated attribute
│ 
│   on cdk.tf.json line 2087, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
│ 2087:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
│ 
│ The attribute "integration_key" is deprecated. Refer to the provider
│ documentation for details.
│ 
│ (and 3 more similar warnings elsewhere)
╵
```

</details>



## :warning: Warnings

```hcl
Warning: Deprecated attribute
 
   on cdk.tf.json line 2087, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
 2087:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
 
 The attribute "integration_key" is deprecated. Refer to the provider
 documentation for details.
 
 (and 3 more similar warnings elsewhere)
```



<!-- github-comment: {"Command":"plan","JobID":"ecdfaef1-b435-4f1c-b795-535e49fd00e6","JobName":"client-api_infrastructure_plan_prod","PRNumber":48,"Program":"tfcmt","SHA1":"ea4e542611e092b147de6a3be89164e8ed2261e6","Target":"client-api-cdk","Vars":{}} -->